# SquareInchesPerFoot Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..SquareInchesPerFoot Property
UnitTypeId Class See Also
---
Square inches per foot.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId SquareInchesPerFoot { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SquareInchesPerFoot As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SquareInchesPerFoot {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace